In [43]:
import pandas as pd

In [44]:
df_raw = pd.read_csv ("./Nilai Ekspor 2016-2020.csv",delimiter=";")

In [45]:
df_raw=df_raw.copy()

In [46]:
df_raw.head()

,Nilai Ekspor (Rp.000),Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,No.,Jenis Ikan,NaN,NaN,NaN,NaN,NaN,Total
1,NaN,NaN,2016,2017,2018,2019,2020,NaN
2,1.,Baung Hias,157.280,18.000,0,0,2.760,178.040
3,2.,kalochroma,22.500,0,0,0,0,22.500
4,3.,Kulliloach,269.000,300,0,0,223.000,492.300

In [47]:
df_raw.columns

Index(['Nilai Ekspor (Rp.000)', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3',
       'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7'],
      dtype='object')

In [48]:
df_rename=df_raw.rename(columns={'Nilai Ekspor (Rp.000)':'No', 'Unnamed: 1':'Jenis Ikan', 'Unnamed: 2':'2016', 'Unnamed: 3':'2017',
       'Unnamed: 4':'2018', 'Unnamed: 5':'2019', 'Unnamed: 6':'2020', 'Unnamed: 7':'Total'})

In [49]:
df_rename.head()

    No  Jenis Ikan     2016    2017  2018  2019     2020    Total
0  No.  Jenis Ikan      NaN     NaN   NaN   NaN      NaN    Total
1  NaN         NaN     2016    2017  2018  2019     2020      NaN
2   1.  Baung Hias  157.280  18.000     0     0    2.760  178.040
3   2.  kalochroma   22.500       0     0     0        0   22.500
4   3.  Kulliloach  269.000     300     0     0  223.000  492.300

In [50]:
df_raw=df_rename.copy

df_rename.drop([0,1],axis=0,inplace=True)
df_rename.drop(columns=["No","Total"],inplace=True)

df_rename.head()

   Jenis Ikan     2016    2017    2018    2019     2020
2  Baung Hias  157.280  18.000       0       0    2.760
3  kalochroma   22.500       0       0       0        0
4  Kulliloach  269.000     300       0       0  223.000
5      Rhombo   11.200   2.520  16.000  27.500        0
6     Seluang   69.000  26.950  14.500  10.500  152.400